# 基础 #
**给每个对象添加一个隐藏成员**，保存指向函数地址数组的指针（虚函数表）。  
虚函数表保存了为类对象进行声明虚函数指针地址。派生类定义虚函数，指针指向自定义的虚函数，否则指向基类的虚函数。  
**使用虚函数的副作用：**  
每个对象都将增大，增大两位存储地址的空间。  
每个类，编译器都将创建一个虚函数地址表（数组）。  
每个函数调用都需要执行一步额外操作，即去表中查找地址。  

# 原理 #  
https://blog.csdn.net/darmao/article/details/81454306  
为了查看对象的结构模型，我们需要在编译器配置时做一些初始化。在VS2010中，在项目——属性——配置属性——C/C++——命令行——其他选项中添加选项“/d1reportAllClassLayout”。再次编译时候，编译器会输出所有定义类的对象模型。由于输出的信息过多，我们可以使用“Ctrl+F”查找命令，找到对象模型的输出。
## 单继承 ##  

  **基类**  
  
    class MyClass
    {
        int var;
    public:
        virtual void fun(){};
    };
    
    //编译后
    1>  class MyClass    size(8):// MyClass对象大小是8个字节
    1>      +---
    1>   0    | {vfptr}   //虚函数表的指针vfptr 4字节
    1>   4    | var       //对象成员var的 4字节
    1>      +---
    1>  
    1>  MyClass::$vftable@:
    1>      | &MyClass_meta
    1>      |  0
    1>   0    | &MyClass::fun
    1>  
    1>  MyClass::fun this adjustor: 0   //adjust表示虚函数机制执行时，this指针的调整量
**MyClass对象模型的结果**  
![image](https://user-images.githubusercontent.com/20179983/118910203-aadf0280-b956-11eb-9796-6cac624337ee.png)
**调用方法**  
MyClass的虚函数表虽然只有一条函数记录，但是它的结尾处是由4字节的0作为结束标记的。
假如fun被多态调用的话，那么它的形式如下：
\*(this+0)[0]()
总结虚函数调用形式，应该是：
**\*(this指针+调整量)[虚函数在vftable内的偏移]()**

** 单重继承对象模型 **  
  
    class MyClassA:public MyClass
    {
        int varA;
    public:
        virtual void fun()
        {}
        virtual void funA()
        {}
    };
    
    //编译后
    1>  class MyClassA    size(12):
    1>      +---
    1>      | +--- (base class MyClass)
    1>   0    | | {vfptr}
    1>   4    | | var
    1>      | +---
    1>   8    | varA
    1>      +---
    1>  
    1>  MyClassA::$vftable@:
    1>      | &MyClassA_meta
    1>      |  0
    1>   0    | &MyClassA::fun
    1>   1    | &MyClassA::funA
    1>  
    1>  MyClassA::fun this adjustor: 0
    1>  MyClassA::funA this adjustor: 0

**MyClassA对象模型的结果**  
![image](https://user-images.githubusercontent.com/20179983/118910598-54be8f00-b957-11eb-8c41-549e04fd7e70.png)

在单继承形式下，子类的完全获得父类的虚函数表和数据。子类如果重写了父类的虚函数（如fun），就会把虚函数表原本fun对应的记录（内容MyClass::fun）覆盖为新的函数地址（内容MyClassA::fun），否则继续保持原本的函数地址记录。如果子类定义了新的虚函数，虚函数表内会追加一条记录，记录该函数的地址（如MyClassA::funA）。

    MyClass*pc=new MyClassA;
    pc->fun();

编译器在处理第二条语句时，发现这是一个多态的调用，那么就会按照上边我们对虚函数的多态访问机制调用函数fun。

    *(pc+0)[0]()

#多重继承对象模型#  
    
    class MyClassB:public MyClass
    {
        int varB;
    public:
        virtual void fun()
        {}
        virtual void funB()
        {}
    };
    
    class MyClassC:public MyClassA,public MyClassB
    {
        int varC;
    public:
        virtual void funB()
        {}
    virtual void funC()
        {}
    };  
    
    1>  class MyClassC    size(28):
    1>      +---
    1>      | +--- (base class MyClassA)
    1>      | | +--- (base class MyClass)
    1>   0    | | | {vfptr}
    1>   4    | | | var
    1>      | | +---
    1>   8    | | varA
    1>      | +---
    1>      | +--- (base class MyClassB)
    1>      | | +--- (base class MyClass)
    1>  12    | | | {vfptr}
    1>  16    | | | var
    1>      | | +---
    1>  20    | | varB
    1>      | +---
    1>  24    | varC
    1>      +---
    1>  
    1>  MyClassC::$vftable@MyClassA@:
    1>      | &MyClassC_meta
    1>      |  0
    1>   0    | &MyClassA::fun
    1>   1    | &MyClassA::funA
    1>   2    | &MyClassC::funC
    1>  
    1>  MyClassC::$vftable@MyClassB@:
    1>      | -12
    1>   0    | &MyClassB::fun
    1>   1    | &MyClassC::funB
    1>  
    1>  MyClassC::funB this adjustor: 12
    1>  MyClassC::funC this adjustor: 0

和单重继承类似，多重继承时MyClassC会把所有的父类全部按序包含在自身内部。而且每一个父类都对应一个单独的虚函数表。  

![image](https://user-images.githubusercontent.com/20179983/118911680-2e015800-b959-11eb-89c0-5b495e42b119.png)

    
多重继承下，子类不再具有自身的虚函数表，它的虚函数表与第一个父类的虚函数表合并了。同样的，如果子类重写了任意父类的虚函数，都会覆盖对应的函数地址记录。如果MyClassC重写了fun函数（两个父类都有该函数），那么两个虚函数表的记录都需要被覆盖！在这里我们发现MyClassC::funB的函数对应的adjust值是12，按照我们前边的规则，可以发现该函数的多态调用形式为：

*(this+12)[1]()

此处的调整量12正好是MyClassB的vfptr在MyClassC对象内的偏移量。

# 虚拟继承对象模型 #  
虚拟继承是为了解决多重继承下公共基类的多份拷贝问题。比如上边的例子中MyClassC的对象内包含MyClassA和MyClassB子对象，但是MyClassA和MyClassB内含有共同的基类MyClass。为了消除MyClass子对象的多份存在，我们需要让MyClassA和MyClassB都虚拟继承于MyClass，然后再让MyClassC多重继承于这两个父类。
  
    class MyClassA:virtual public MyClass
    class MyClassB:virtual public MyClass
    class MyClassC:public MyClassA,public MyClassB  
    //由于虚继承的本身语义，MyClassC内必须重写fun函数，因此我们需要再重写fun函数  
    1>  class MyClassC    size(36):
    1>      +---
    1>      | +--- (base class MyClassA)
    1>   0    | | {vfptr}
    1>   4    | | {vbptr}
    1>   8    | | varA
    1>      | +---
    1>      | +--- (base class MyClassB)
    1>  12    | | {vfptr}
    1>  16    | | {vbptr}
    1>  20    | | varB
    1>      | +---
    1>  24    | varC
    1>      +---
    1>      +--- (virtual base MyClass)
    1>  28    | {vfptr}
    1>  32    | var
    1>      +---
    1>  
    1>  MyClassC::$vftable@MyClassA@:
    1>      | &MyClassC_meta
    1>      |  0
    1>   0    | &MyClassA::funA
    1>   1    | &MyClassC::funC
    1>  
    1>  MyClassC::$vftable@MyClassB@:
    1>      | -12
    1>   0    | &MyClassC::funB
    1>  
    1>  MyClassC::$vbtable@MyClassA@:
    1>   0    | -4
    1>   1    | 24 (MyClassCd(MyClassA+4)MyClass)
    1>  
    1>  MyClassC::$vbtable@MyClassB@:
    1>   0    | -4
    1>   1    | 12 (MyClassCd(MyClassB+4)MyClass)
    1>  
    1>  MyClassC::$vftable@MyClass@:
    1>      | -28
    1>   0    | &MyClassC::fun
    1>  
    1>  MyClassC::fun this adjustor: 28
    1>  MyClassC::funB this adjustor: 12
    1>  MyClassC::funC this adjustor: 0
    1>  
    1>  vbi:       class  offset o.vbptr  o.vbte fVtorDisp
    1>           MyClass      28       4       4 0

虚继承的引入把对象的模型变得十分复杂，除了每个基类（MyClassA和MyClassB）和公共基类（MyClass）的虚函数表指针需要记录外，每个虚拟继承了MyClass的父类还需要记录一个虚基类表vbtable的指针vbptr。MyClassC的对象模型如图4所示。
![image](https://user-images.githubusercontent.com/20179983/118912024-be3f9d00-b959-11eb-9248-c3cba445df82.png)
虚基类表每项记录了被继承的虚基类子对象相对于虚基类表指针的偏移量。比如MyClassA的虚基类表第二项记录值为24，正是MyClass::vfptr相对于MyClassA::vbptr的偏移量，同理MyClassB的虚基类表第二项记录值12也正是MyClass::vfptr相对于MyClassA::vbptr的偏移量。

和虚函数表不同的是，虚基类表的第一项记录着当前子对象相对与虚基类表指针的偏移。MyClassA和MyClassB子对象内的虚表指针都是存储在相对于自身的4字节偏移处，因此该值是-4。假定MyClassA和MyClassC或者MyClassB内没有定义新的虚函数，即不会产生虚函数表，那么虚基类表第一项字段的值应该是0。

通过以上的对象组织形式，编译器解决了公共虚基类的多份拷贝的问题。通过每个父类的虚基类表指针，都能找到被公共使用的虚基类的子对象的位置，并依次访问虚基类子对象的数据。至于虚基类定义的虚函数，它和其他的虚函数的访问形式相同，本例中，如果使用虚基类指针MyClass*pc访问MyClassC对象的fun，将会被转化为如下形式：

*(pc+28)[0]()

